CDockingManager.GetSmartDockingTheme
A static method that returns a theme used to display smart docking markers.
Returns:
Returns one of the following enumerated values: AFX_SDT_DEFAULT, AFX_SDT_VS2005, AFX_SDT_VS2008.

CDockingManager.SetDockingMode(AFX_DOCK_TYPE,AFX_SMARTDOCK_THEME)
Sets docking mode.
dockMode: Specifies a docking mode to set. It should be one of the following
enumerated values: DT_IMMEDIATE, DT_STANDARD or combination of DT_IMMEDIATE and DT_SMART.
theme: Specifies the theme to be used for smart docking markers. It can be
one of the following enumerated values: AFX_SDT_DEFAULT, AFX_SDT_VS2005, AFX_SDT_VS2008.